Revit 2027 API
LineProperties.Transparency Property
 The current transparency level to be applied to the current color.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Transparency { get; }
Public ReadOnly Property Transparency As Integer
	Get
public:
property int Transparency {
	int get ();
}
member Transparency : int with get
Property Value
Int32
See Also
Reference
LineProperties Class
Autodesk.Revit.DB Namespace